Sheepwool68/Echo_EAIMXRT_1062/real_project_config/board/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPins
 * Description   : 
 *
 * END ****************************************************************************************************************/
void BOARD_InitPins(void) {
  CLOCK_EnableClock(kCLOCK_Iomuxc);           

  /* GPIO configuration of PPS on GPIO_AD_B0_02 (pin M11) */
  gpio_pin_config_t PPS_config = {
      .direction = kGPIO_DigitalInput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_IntRisingEdge
  };
  /* Initialize GPIO functionality on GPIO_AD_B0_02 (pin M11) */
  GPIO_PinInit(GPIO1, 2U, &PPS_config);
  /* Enable GPIO pin interrupt on GPIO_AD_B0_02 (pin M11) */
  GPIO_PortEnableInterrupts(GPIO1, 1U << 2U);

  /* GPIO configuration of TIMEPULSE on GPIO_AD_B0_03 (pin G11) */
  gpio_pin_config_t TIMEPULSE_config = {
      .direction = kGPIO_DigitalInput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_IntFallingEdge
  };
  /* Initialize GPIO functionality on GPIO_AD_B0_03 (pin G11) */
  GPIO_PinInit(GPIO1, 3U, &TIMEPULSE_config);
  /* Enable GPIO pin interrupt on GPIO_AD_B0_03 (pin G11) */
  GPIO_PortEnableInterrupts(GPIO1, 1U << 3U);

  /* GPIO configuration of SPI_CS2 on GPIO_AD_B0_04 (pin F11) */
  gpio_pin_config_t SPI_CS2_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_AD_B0_04 (pin F11) */
  GPIO_PinInit(GPIO1, 4U, &SPI_CS2_config);

  /* GPIO configuration of FAN_CONTROL on GPIO_AD_B1_04 (pin L12) */
  gpio_pin_config_t FAN_CONTROL_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_AD_B1_04 (pin L12) */
  GPIO_PinInit(GPIO1, 20U, &FAN_CONTROL_config);

  /* GPIO configuration of BUZZER on GPIO_AD_B1_05 (pin K12) */
  gpio_pin_config_t BUZZER_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_AD_B1_05 (pin K12) */
  GPIO_PinInit(GPIO1, 21U, &BUZZER_config);

  /* GPIO configuration of MODEM_PWR on GPIO_AD_B1_06 (pin J12) */
  gpio_pin_config_t MODEM_PWR_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_AD_B1_06 (pin J12) */
  GPIO_PinInit(GPIO1, 22U, &MODEM_PWR_config);

  /* GPIO configuration of TRIGGER on GPIO_AD_B1_07 (pin K10) */
  gpio_pin_config_t TRIGGER_config = {
      .direction = kGPIO_DigitalInput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_IntRisingEdge
  };
  /* Initialize GPIO functionality on GPIO_AD_B1_07 (pin K10) */
  GPIO_PinInit(GPIO1, 23U, &TRIGGER_config);
  /* Enable GPIO pin interrupt on GPIO_AD_B1_07 (pin K10) */
  GPIO_PortEnableInterrupts(GPIO1, 1U << 23U);

  /* GPIO configuration of MODEM_DTR on GPIO_AD_B1_08 (pin H13) */
  gpio_pin_config_t MODEM_DTR_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 1U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_AD_B1_08 (pin H13) */
  GPIO_PinInit(GPIO1, 24U, &MODEM_DTR_config);

  /* GPIO configuration of SPI_CS on GPIO_AD_B1_12 (pin H12) */
  gpio_pin_config_t SPI_CS_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_AD_B1_12 (pin H12) */
  GPIO_PinInit(GPIO1, 28U, &SPI_CS_config);

  /* GPIO configuration of USB_DTR on GPIO_B1_00 (pin A11) */
  gpio_pin_config_t USB_DTR_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_B1_00 (pin A11) */
  GPIO_PinInit(GPIO2, 16U, &USB_DTR_config);

  /* GPIO configuration of NRF_READY on GPIO_SD_B1_02 (pin M3) */
  gpio_pin_config_t NRF_READY_config = {
      .direction = kGPIO_DigitalInput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_SD_B1_02 (pin M3) */
  GPIO_PinInit(GPIO3, 2U, &NRF_READY_config);

  /* GPIO configuration of BUTTON_LED on GPIO_SD_B1_04 (pin P2) */
  gpio_pin_config_t BUTTON_LED_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 1U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_SD_B1_04 (pin P2) */
  GPIO_PinInit(GPIO3, 4U, &BUTTON_LED_config);

  /* GPIO configuration of READER_SHUTDOWN on GPIO_SD_B0_03 (pin K1) */
  gpio_pin_config_t READER_SHUTDOWN_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_SD_B0_03 (pin K1) */
  GPIO_PinInit(GPIO3, 15U, &READER_SHUTDOWN_config);

  /* GPIO configuration of READER_PWR on GPIO_SD_B0_05 (pin J2) */
  gpio_pin_config_t READER_PWR_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_SD_B0_05 (pin J2) */
  GPIO_PinInit(GPIO3, 17U, &READER_PWR_config);

  /* GPIO configuration of USB_STATUS on GPIO_EMC_00 (pin E3) */
  gpio_pin_config_t USB_STATUS_config = {
      .direction = kGPIO_DigitalInput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_EMC_00 (pin E3) */
  GPIO_PinInit(GPIO4, 0U, &USB_STATUS_config);

  IOMUXC_SetPinMux(IOMUXC_GPIO_AD_B0_02_GPIO1_IO02, 1U); 
  IOMUXC_SetPinMux(IOMUXC_GPIO_AD_B0_03_GPIO1_IO03, 1U); 
  IOMUXC_SetPinMux(IOMUXC_GPIO_AD_B0_04_GPIO1_IO04, 0U); 
  IOMUXC_SetPinMux(IOMUXC_GPIO_AD_B0_12_LPUART1_TX, 1U); 
  IOMUXC_SetPinMux(IOMUXC_GPIO_AD_B0_13_LPUART1_RX, 1U); 
  IOMUXC_SetPinMux(IOMUXC_GPIO_AD_B1_00_LPI2C1_SCL, 1U); 
  IOMUXC_SetPinMux(IOMUXC_GPIO_AD_B1_01_LPI2C1_SDA, 1U); 
  IOMUXC_SetPinMux(IOMUXC_GPIO_AD_B1_02_LPUART2_TX, 0U); 
  IOMUXC_SetPinMux(IOMUXC_GPIO_AD_B1_03_LPUART2_RX, 0U); 
  IOMUXC_SetPinMux(IOMUXC_GPIO_AD_B1_04_GPIO1_IO20, 0U); 
  IOMUXC_SetPinMux(IOMUXC_GPIO_AD_B1_05_GPIO1_IO21, 0U); 
  IOMUXC_SetPinMux(IOMUXC_GPIO_AD_B1_06_GPIO1_IO22, 0U); 
  IOMUXC_SetPinMux(IOMUXC_GPIO_AD_B1_07_GPIO1_IO23, 0U); 
  IOMUXC_SetPinMux(IOMUXC_GPIO_AD_B1_08_GPIO1_IO24, 1U); 
  IOMUXC_SetPinMux(IOMUXC_GPIO_AD_B1_10_LPUART8_TX, 0U); 
  IOMUXC_SetPinMux(IOMUXC_GPIO_AD_B1_11_LPUART8_RX, 0U); 
  IOMUXC_SetPinMux(IOMUXC_GPIO_AD_B1_12_GPIO1_IO28, 0U); 
  IOMUXC_SetPinMux(IOMUXC_GPIO_AD_B1_13_LPSPI3_SDI, 0U); 
  IOMUXC_SetPinMux(IOMUXC_GPIO_AD_B1_14_LPSPI3_SDO, 0U); 
#if FSL_IOMUXC_DRIVER_VERSION >= MAKE_VERSION(2, 0, 4)
  IOMUXC_SetPinMux(IOMUXC_GPIO_AD_B1_15_LPSPI3_SCK, 0U); 
#endif
  IOMUXC_SetPinMux(IOMUXC_GPIO_B1_00_GPIO2_IO16, 0U); 
  IOMUXC_SetPinMux(IOMUXC_GPIO_B1_12_LPUART5_TX, 0U); 
  IOMUXC_SetPinMux(IOMUXC_GPIO_B1_13_LPUART5_RX, 0U); 
  IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_00_GPIO4_IO00, 0U); 
  IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B0_03_GPIO3_IO15, 0U); 
  IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B0_05_GPIO3_IO17, 0U); 
  IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B1_02_GPIO3_IO02, 0U); 
  IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B1_04_GPIO3_IO04, 0U); 
  IOMUXC_GPR->GPR26 = ((IOMUXC_GPR->GPR26 &
    (~(BOARD_INITPINS_IOMUXC_GPR_GPR26_GPIO_MUX1_GPIO_SEL_MASK))) 
      | IOMUXC_GPR_GPR26_GPIO_MUX1_GPIO_SEL(0x00U) 
    );
  IOMUXC_GPR->GPR27 = ((IOMUXC_GPR->GPR27 &
    (~(BOARD_INITPINS_IOMUXC_GPR_GPR27_GPIO_MUX2_GPIO_SEL_MASK))) 
      | IOMUXC_GPR_GPR27_GPIO_MUX2_GPIO_SEL(0x00U) 
    );
  IOMUXC_GPR->GPR28 = ((IOMUXC_GPR->GPR28 &
    (~(BOARD_INITPINS_IOMUXC_GPR_GPR28_GPIO_MUX3_GPIO_SEL_MASK))) 
      | IOMUXC_GPR_GPR28_GPIO_MUX3_GPIO_SEL(0x00U) 
    );
  IOMUXC_GPR->GPR29 = ((IOMUXC_GPR->GPR29 &
    (~(BOARD_INITPINS_IOMUXC_GPR_GPR29_GPIO_MUX4_GPIO_SEL_MASK))) 
      | IOMUXC_GPR_GPR29_GPIO_MUX4_GPIO_SEL(0x00U) 
    );
  IOMUXC_SetPinConfig(IOMUXC_GPIO_AD_B0_02_GPIO1_IO02, 0x20B1U); 
  IOMUXC_SetPinConfig(IOMUXC_GPIO_AD_B0_03_GPIO1_IO03, 0x20B0U); 
  IOMUXC_SetPinConfig(IOMUXC_GPIO_AD_B0_04_GPIO1_IO04, 0x1079U); 
  IOMUXC_SetPinConfig(IOMUXC_GPIO_AD_B0_13_LPUART1_RX, 0x10B0U); 
  IOMUXC_SetPinConfig(IOMUXC_GPIO_AD_B1_00_LPI2C1_SCL, 0xE871U); 
  IOMUXC_SetPinConfig(IOMUXC_GPIO_AD_B1_01_LPI2C1_SDA, 0xE871U); 
  IOMUXC_SetPinConfig(IOMUXC_GPIO_AD_B1_06_GPIO1_IO22, 0xB0U); 
  IOMUXC_SetPinConfig(IOMUXC_GPIO_AD_B1_07_GPIO1_IO23, 0x10F0U); 
  IOMUXC_SetPinConfig(IOMUXC_GPIO_AD_B1_08_GPIO1_IO24, 0xA0B0U); 
  IOMUXC_SetPinConfig(IOMUXC_GPIO_AD_B1_12_GPIO1_IO28, 0x1079U); 
  IOMUXC_SetPinConfig(IOMUXC_GPIO_AD_B1_13_LPSPI3_SDI, 0x0100B0U); 
  IOMUXC_SetPinConfig(IOMUXC_GPIO_AD_B1_14_LPSPI3_SDO, 0x1079U); 
#if FSL_IOMUXC_DRIVER_VERSION >= MAKE_VERSION(2, 0, 4)
  IOMUXC_SetPinConfig(IOMUXC_GPIO_AD_B1_15_LPSPI3_SCK, 0x1079U); 
#endif
  IOMUXC_SetPinConfig(IOMUXC_GPIO_SD_B1_04_GPIO3_IO04, 0xB0U);
  /* NRF_READY (GPIO3 pin 2, GPIO_SD_B1_02) pad config REVERTED
   * 2026-07-20 -- was added 2026-07-20 (same day) as a precautionary
   * fix for a "READY asserts without a chip read" symptom that was
   * subsequently found NOT to be a bug at all (READY genuinely means
   * "nRF SPI armed and ready to talk", not "tag read available" --
   * see project memory). This pin worked correctly for this entire
   * session's nRF investigation before this SetPinConfig call was
   * added, and immediately after it was added, NRF_READY was reported
   * completely stuck (no edge-trigger trace at all, not even the
   * "went HIGH" print that fired constantly before). Never based on a
   * confirmed hardware need -- reused an unverified value (0x10B0)
   * hand-picked from an unrelated pin rather than a decoded register
   * value, flagged as a real risk at the time. Reverting to no
   * SetPinConfig call at all (silicon power-on-reset default, the
   * state this pin ran in for every other nRF success this session)
   * to test whether that alone restores it before trying anything
   * else. */
}
/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
